import math
print('Дон Василь ІС-01')
x = float(input('Введіть х: '))
m = float(input('Введіть m: '))
e = float(input('Введіть e: '))

n = 0  #Лічильник
s = 1  #Сума ряду
r = 1  #Різниця сусідніх елементів
p1 = 1 #Поточний член
p2 = 1 #Наступний член

while r > e:
    n = n + 1
    #Визначення настпуного члена:
    p2 = p1 * x * (m - n + 1) / n
    #Сума:
    s = s + p2
    #Перевірка точності:
    r = math.fabs(p2 - p1)
    #Присвоюємо нове(наступне) значення поточному члену:
    p1 = p2

print ('s =' , s)
print ('Перевірка: ' , math.pow((1 + x) , m))
